


object generate_mapping_sql   {
  def main(args: Array[String]) {
  val keyStr = "128,129,130,131,132,133,134,135,136,137,138,139,140,141,145,146,147,148,152,153,154,155,156,173,176,177,178,179,180,181,182,183,184,185,186,187,188,189,197,198,199,200,201,203,204,205,209,210,211,212,213,218,241,242,243,244,245,246,247,250,276,282,283,284,339,340,341,342,343,344,345,346,347,351,361,367,371,373,374,375,376,190,191,192,214,215,216,219,220,221,222,223,298,299,300,157,158,159,160,161,162,163,164,166,167,168,169,170,171,172,202,206,207,208,217,224,292,293,294,295,296,297,174,281,348,349,350,355,356,357,358,359,362,363,364,365,366,360,368,369,372,353,354,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,248,249,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,277,278,279,280,285,286,287,288,289,290,291,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,334,335,338,370,336,337,175,352"
	val valueStr = "利姆萨·罗敏萨上层甲板,利姆萨·罗敏萨下层甲板,乌尔达哈现世回廊,乌尔达哈来生回廊,格里达尼亚新街,格里达尼亚旧街,中拉诺西亚,拉诺西亚低地,海雾村,东拉诺西亚,西拉诺西亚,拉诺西亚高地,西萨纳兰,中萨纳兰,东萨纳兰,南萨纳兰,北萨纳兰,黑衣森林中央林区,黑衣森林东部林区,黑衣森林南部林区,黑衣森林北部林区,库尔札斯中央高地,摩杜纳,艾欧泽亚地下空间,陌迪翁监狱,后桅旅店,沙钟旅亭,栖木旅馆,拉诺西亚外地,利姆萨·罗敏萨,乌尔达哈现世回廊,格里达尼亚新街,0,0,0,0,0,0,0,提督室,利姆萨·罗敏萨会议室,利姆萨·罗敏萨演讲室,0,0,神勇队司令室,芙蓉圆桌,0,银胄团总长室,芳香堂,沙之家,0,黑衣森林北部林区,陨石勘查坑表层,陨石勘查坑深层,诸神黄昏级拘束舰,隔离壁,中枢区,0,第一舰桥,狼狱停船场,次元缝隙迎宾室,海雾村私人小屋,海雾村私人公馆,海雾村私人别墅,海雾村,薰衣草苗圃,高脚孤丘,薰衣草苗圃私人小屋,薰衣草苗圃私人公馆,薰衣草苗圃私人别墅,高脚孤丘私人小屋,高脚孤丘私人公馆,高脚孤丘私人别墅,石之家,0,0,0,0,0,0,0,黑衣森林中央林区,黑衣森林东部林区,黑衣森林南部林区,中拉诺西亚,西萨纳兰,中萨纳兰,黑衣森林中央林区,黑衣森林南部林区,拉诺西亚高地,拉诺西亚低地,库尔札斯中央高地,库尔札斯中央高地,摩杜纳,摩杜纳,沙斯塔夏溶洞,布雷福洛克斯野营地,放浪神古神殿,天狼星灯塔,铜铃铜山,日影地修炼所,喀恩埋没圣堂,塔姆·塔拉墓园,静语庄园,无限城古堡,石卫塔,托托·拉克千狱,樵鸣洞,泽梅尔要塞,黄金谷,炎帝陵,奥·哥摩罗火口神殿,荆棘之园,呼啸眼石塔群,帝国南方堡,天幕魔导城,炎帝陵,奥·哥摩罗火口神殿,呼啸眼石塔群,炎帝陵,奥·哥摩罗火口神殿,呼啸眼石塔群,古代人迷宫,对利维亚桑双体船,后营门,铜铃铜山,静语庄园,陨石背阴地,拘束舰外围,诸神黄昏级三号舰舰体中央,诸神黄昏级三号舰作战室,对利维亚桑双体船,布雷福洛克斯野营地,无限城市街古迹,荆棘之园,石卫塔,狮鹫大桥,日影地修炼所,圣人泪,兽斗间,古代人迷宫,对利维亚桑双体船,后营门,牢狱之影,大树之荫下蠢动的黑暗,蕾亚的遗物,西尔瓦尔的弓术训练,射向黑暗之箭,雾中的歧路,毫无迷惘的眼瞳,浮出水面的犯人,追踪可疑者,水之试炼,领悟自然,毫无迷惘的眼瞳,实力的证明,命运的长枪,勇气的证明,勇气的证明,成功的两面,烈火中的胜利号,拳圣,海词石窟的潜伏者,0,箭雨中的胜机,蠢动的黑暗,利剑与铁拳的交锋,纳尔札尔双剑,斗魂不再,点燃斗魂,烈火光明星，驰骋奔流星,拳圣,豪杰的试练与责任,移动山脉库加塔,突破阻隔,斩断宿怨之日,狂猛之危,围困之危,射向深渊的光,胆小之人的勇气,大霸王树下,至宝的暗影,背叛的代价,铜刃之中的正义,消失在铜铃中的梦,凶猛火神伊弗利特,前行之路（双蛇党）,前行之路（恒辉队）,前行之路（黑涡团）,雨燕塔殖民地的黑暗,0,凄惨的临检战术,固执的夹击战术,秘术最高级命题的证明,0,命运的长枪,心为森所惑,异端审问,对抗巨龙的历史,克拉克希奥的决心,重振旗鼓,逃离中央堡,小阿拉米格的大麻烦,愤怒的风车看守人,夺取魔导装甲,魔导兵器所见之梦,责任与使命,顶级战士,各怀异心,高举骑士的圣剑,亡国的雷鸣,废王的回归,苍天之龙骑士,劝诱的迷雾，阴沉的门扉,黑魔的引导，法师的真实,伟人的后继者,镇抚的仪式,罪孽深重的愚者,生命的赞歌,业火的召唤,大地的召唤,烈风的召唤,邪道与正道,被遗忘的学问,现实化的怨恨,新时代的学者,疯狂的歌声,呼啸眼外围,西萨纳兰,0,0,摩杜纳,艾欧泽亚地下空间,诸神黄昏级三号舰第一舰桥,狼狱水上竞技场,狼狱水上竞技场,狼狱水上竞技场,狼狱水上竞技场"
	
	val keyArr = keyStr.split(",",-1)
	val valueArr = valueStr.split(",",-1)
	
	val size = keyArr.size
	
	val mapping_type = "territory"
	
	val app = "ff14"
	  
	for(i <- 0 until size) {
	  println("insert into app_mapping values('"+app+"', '"+mapping_type+"', '"+keyArr(i)+"', '"+valueArr(i)+"' );  ")
	}
}
}